In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [6]:
dframe

   dataset1  dataset2 k1     k2
0  1.423465  1.172190  X  alpha
1 -0.401029 -0.894464  X   beta
2  0.029570  0.408283  Y  alpha
3  0.004424 -0.850957  Y   beta
4  0.637813  1.318848  Z  alpha

In [7]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [8]:
group1

In [9]:
group1.mean()

k1
X    0.511218
Y    0.016997
Z    0.637813
Name: dataset1, dtype: float64

In [12]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [13]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.401029
    JAN    0.029570
NY  FEB    0.004424
    JAN    1.030639
Name: dataset1, dtype: float64

In [14]:
dframe

   dataset1  dataset2 k1     k2
0  1.423465  1.172190  X  alpha
1 -0.401029 -0.894464  X   beta
2  0.029570  0.408283  Y  alpha
3  0.004424 -0.850957  Y   beta
4  0.637813  1.318848  Z  alpha

In [15]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.511218  0.138863
Y   0.016997 -0.221337
Z   0.637813  1.318848

In [21]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.423465  1.172190
   beta  -0.401029 -0.894464
Y  alpha  0.029570  0.408283
   beta   0.004424 -0.850957
Z  alpha  0.637813  1.318848

In [17]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [22]:
for name, group in dframe.groupby('k1')
print "This is the %s group" %name
print group
print '\n'

SyntaxError: invalid syntax (<ipython-input-22-c79d85df33a5>, line 1)